In [1]:
import pandas as pd

# JSON

In [3]:
# De una URL
URL = 'https://raw.githubusercontent.com/BindiChen/machine-learning/master/data-analysis/027-pandas-convert-json/data/simple.json'
df = pd.read_json(URL)
df.head(10)

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

# Nested JSON
Un "nested JSON" se refiere a un objeto JSON que contiene otros objetos JSON anidados dentro de sí mismo. JSON (JavaScript Object Notation) es un formato de intercambio de datos que se utiliza comúnmente para representar datos estructurados en forma de objetos y matrices. La anidación en JSON se refiere a la inclusión de objetos JSON o matrices dentro de otros objetos JSON o matrices.

In [5]:
# Ejemplo
data = {
    "estudiantes": [
        {
            "nombre": "Juan",
            "edad": 20,
            "cursos": [
                {"nombre_curso": "Matemáticas", "nota": 90},
                {"nombre_curso": "Historia", "nota": 85}
            ]
        },
        {
            "nombre": "María",
            "edad": 22,
            "cursos": [
                {"nombre_curso": "Matemáticas", "nota": 88},
                {"nombre_curso": "Ciencias", "nota": 92}
            ]
        }
    ]
}

In [6]:
data['estudiantes']

[{'nombre': 'Juan',
  'edad': 20,
  'cursos': [{'nombre_curso': 'Matemáticas', 'nota': 90},
   {'nombre_curso': 'Historia', 'nota': 85}]},
 {'nombre': 'María',
  'edad': 22,
  'cursos': [{'nombre_curso': 'Matemáticas', 'nota': 88},
   {'nombre_curso': 'Ciencias', 'nota': 92}]}]

In [7]:
# Crear un DataFrame desde el JSON anidado
df_estudiantes = pd.json_normalize(data = data['estudiantes'])
df_estudiantes

  nombre  edad                                             cursos
0   Juan    20  [{'nombre_curso': 'Matemáticas', 'nota': 90}, ...
1  María    22  [{'nombre_curso': 'Matemáticas', 'nota': 88}, ...

In [8]:
# Normalizar la lista de cursos
df_cursos = pd.json_normalize(data = data['estudiantes'], # Primera clave
                              record_path = 'cursos', # Siguiente clave
                              meta = ['nombre', 'edad']) # metadatos
df_cursos

  nombre_curso  nota nombre edad
0  Matemáticas    90   Juan   20
1     Historia    85   Juan   20
2  Matemáticas    88  María   22
3     Ciencias    92  María   22